#####################################################################
#
# Init setup file
# Created by Genus(TM) Synthesis Solution on 05/04/2022 15:23:23
#
#####################################################################


read_mmmc innovus/NextZ80.mmmc.tcl

read_physical -lef {/pdk/xfab/XC018_61_3.1.3/cadence/xc018/LEF/xc018_m6_FE/xc018m6_FE.lef /pdk/xfab/XC018_61_3.1.3/cadence/xc018/LEF/xc018_m6_FE/D_CELLS.lef /pdk/xfab/XC018_61_3.1.3/cadence/xc018/LEF/xc018_m6_FE/IO_CELLS_5V.lef}

read_netlist innovus/NextZ80.v

init_design
